Applying **Development**:

```diff
module.complete.data.http.my_public_ip: Reading...
data.http.my_public_ip: Reading...
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.random_id.this: Refreshing state... [id=rQ]
random_id.this: Refreshing state... [id=GA]
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=7d72af341a1b4acc57d87690b2deea29db5e70ea]
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Reading...
data.aws_region.current: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy]
module.complete.data.aws_caller_identity.current: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete18]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-ad]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x|9AC04665-6704-4F8C-91B9-1124DE5F9C2C]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz|95E6CFB8-BD38-4932-8A1F-95A55F053E1C]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=5822fc301c3e9fbe31f68a1d9f1c58b75ab072de7130b0f58be25d470bbec54b]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=489067993]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy|03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=1269699362]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0200ad8ff9169a516]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-ad-447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Read complete after 0s [id=ami-037703324ef265430]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Read complete after 0s [id=ami-0d7615ce54a8138e1]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 1s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 1s [id=ami-04b0be28f678af9ee]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0df7b78c6184b1c29]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-035862d72b4502a0c]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-01b7f2fd859183ca8]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0e9b786fa5ab6150b]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-09e076ed70ef7b370]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb46e8b77de1c569]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00eea38b570eaa98a]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-07414f5c789daf829]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-05dfd1da27fc6beff]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-0632b92421afac6e9]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0cb46e8b77de1c5691080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-064c7b34fe4c2c906]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0ebe68af53f551e35]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0e9b786fa5ab6150b1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-01b124790260b961a]
module.complete.aws_lambda_function.this: Refreshing state... [id=XG-Initial-Config-SOPHOS_CNF-ad]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-03ddb586d2a556961]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-ad]
module.complete.aws_instance.this: Refreshing state... [id=i-03a4e07a7fffe273d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-01b124790260b961a"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-ad"
        name        = "ec2-instance-profile-SOPHOS_CNF-ad"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
        id                    = "LambdaExecutionRole-SOPHOS_CNF-ad"
        name                  = "LambdaExecutionRole-SOPHOS_CNF-ad"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com" -> null
-           "creation_date" = "10-03-2022" -> null
-           "managed_by"    = "Terraform" -> null
        }
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-ad-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-ad-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-03a4e07a7fffe273d"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "06553fd0512ceebd68566f9e5d2b0cac2923b540" -> "bb83833ffa88c2d2e3c29b74a22dc7ebe8c2d911"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-00eea38b570eaa98a"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "XG-Initial-Config-SOPHOS_CNF-ad"
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "CONSOLE_SECRET_ARN"  = "sophos-fw-console-password-SOPHOS_CNF-ad" -> null
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy"
-               "DEFAULT_PASSWORD"    = "admin" -> null
-               "DEFAULT_USER"        = "admin" -> null
-               "HOST_IP"             = "10.0.1.61" -> null
+               "IP"                  = "10.0.1.61"
+               "PASSWORD"            = "admin"
+               "USERNAME"            = "admin"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-03ddb586d2a556961"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-ad-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-064c7b34fe4c2c906"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-0632b92421afac6e9"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e9b786fa5ab6150b"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0cb46e8b77de1c569"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password must be replaced
-/+ resource "aws_secretsmanager_secret_version" "config_backup_password" {
      ~ arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x|9AC04665-6704-4F8C-91B9-1124DE5F9C2C" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "9AC04665-6704-4F8C-91B9-1124DE5F9C2C" -> (known after apply)
      ~ version_stages = [
-           "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.complete.aws_secretsmanager_secret_version.console_password must be replaced
-/+ resource "aws_secretsmanager_secret_version" "console_password" {
      ~ arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy|03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8" -> (known after apply)
      ~ version_stages = [
-           "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      ~ arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz|95E6CFB8-BD38-4932-8A1F-95A55F053E1C" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "95E6CFB8-BD38-4932-8A1F-95A55F053E1C" -> (known after apply)
      ~ version_stages = [
-           "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-09e076ed70ef7b370"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-07414f5c789daf829"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-035862d72b4502a0c"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "4.1.23.100/32",
-                   "47.184.79.94/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.245.18.123/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01b7f2fd859183ca8"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0200ad8ff9169a516"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-ad-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "10-03-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 3 to add, 17 to change, 3 to destroy.

Changes to Outputs:
+   archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7"
+   availability_zone_map = {
+       us-west-1b = "usw1-az3"
+       us-west-1c = "usw1-az1"
    }
-   console_secret_name   = "sophos-fw-console-password-SOPHOS_CNF-ad" -> null
-   public_ip             = [
-       "13.57.112.11",
    ] -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```
module.complete.data.archive_file.lambda_zip: Reading...
data.http.my_public_ip: Reading...
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=7d72af341a1b4acc57d87690b2deea29db5e70ea]
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=GA]
module.complete.random_id.this: Refreshing state... [id=rQ]
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-ad]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete18]
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
module.complete.data.aws_availability_zones.available: Read complete after 1s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz|95E6CFB8-BD38-4932-8A1F-95A55F053E1C]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy|03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8]
module.complete.data.template_file.user_data: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x|9AC04665-6704-4F8C-91B9-1124DE5F9C2C]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=489067993]
module.complete.data.template_file.user_data: Read complete after 0s [id=5822fc301c3e9fbe31f68a1d9f1c58b75ab072de7130b0f58be25d470bbec54b]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=1269699362]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_caller_identity.current: Read complete after 1s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0200ad8ff9169a516]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-ad-447552758530]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Read complete after 0s [id=ami-0d7615ce54a8138e1]
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Read complete after 0s [id=ami-037703324ef265430]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00eea38b570eaa98a]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-07414f5c789daf829]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0df7b78c6184b1c29]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-09e076ed70ef7b370]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-01b7f2fd859183ca8]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0e9b786fa5ab6150b]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb46e8b77de1c569]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-035862d72b4502a0c]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0cb46e8b77de1c5691080289494]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-0632b92421afac6e9]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-05dfd1da27fc6beff]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-064c7b34fe4c2c906]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0ebe68af53f551e35]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-01b124790260b961a]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0e9b786fa5ab6150b1080289494]
module.complete.aws_lambda_function.this: Refreshing state... [id=XG-Initial-Config-SOPHOS_CNF-ad]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-ad]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-03ddb586d2a556961]
module.complete.aws_instance.this: Refreshing state... [id=i-03a4e07a7fffe273d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "example-completeGA==" -> null
      - b64_url     = "example-completeGA" -> null
      - byte_length = 1 -> null
      - dec         = "example-complete24" -> null
      - hex         = "example-complete18" -> null
      - id          = "GA" -> null
      - prefix      = "example-complete" -> null
    }

  # module.complete.aws_eip.this[0] will be destroyed
  - resource "aws_eip" "this" {
      - allocation_id             = "eipalloc-01b124790260b961a" -> null
      - associate_with_private_ip = "10.0.0.188" -> null
      - association_id            = "eipassoc-0e64b62d2922b5bb5" -> null
      - domain                    = "vpc" -> null
      - id                        = "eipalloc-01b124790260b961a" -> null
      - instance                  = "i-03a4e07a7fffe273d" -> null
      - network_border_group      = "us-west-1" -> null
      - network_interface         = "eni-0632b92421afac6e9" -> null
      - private_dns               = "ip-10-0-0-188.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.188" -> null
      - public_dns                = "ec2-13-57-112-11.us-west-1.compute.amazonaws.com" -> null
      - public_ip                 = "13.57.112.11" -> null
      - public_ipv4_pool          = "amazon" -> null
      - tags                      = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc                       = true -> null
    }

  # module.complete.aws_iam_instance_profile.this will be destroyed
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::447552758530:instance-profile/ec2-instance-profile-SOPHOS_CNF-ad" -> null
      - create_date = "2022-10-03T21:48:52Z" -> null
      - id          = "ec2-instance-profile-SOPHOS_CNF-ad" -> null
      - name        = "ec2-instance-profile-SOPHOS_CNF-ad" -> null
      - path        = "/" -> null
      - role        = "ec2-iam-role-SOPHOS_CNF-ad-447552758530" -> null
      - tags        = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id   = "AIPAWQNBZEMBJV546UD4R" -> null
    }

  # module.complete.aws_iam_role.lambda_execution_role will be destroyed
  - resource "aws_iam_role" "lambda_execution_role" {
      - arn                   = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-ad" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-10-03T21:48:51Z" -> null
      - force_detach_policies = false -> null
      - id                    = "LambdaExecutionRole-SOPHOS_CNF-ad" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "LambdaExecutionRole-SOPHOS_CNF-ad" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBADBXDGGTN" -> null

      - inline_policy {
          - name   = "lambda-config-policy-SOPHOS_CNF-ad" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DescribeInstances",
                              - "ec2:DeleteNetworkInterface",
                              - "ec2:CreateNetworkInterface",
                              - "ec2:AttachNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_iam_role.this will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::447552758530:role/ec2-iam-role-SOPHOS_CNF-ad-447552758530" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-10-03T21:48:51Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2-iam-role-SOPHOS_CNF-ad-447552758530" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2-iam-role-SOPHOS_CNF-ad-447552758530" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBFXANSPJFU" -> null

      - inline_policy {
          - name   = "ec2-policy-SOPHOS_CNF-ad" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy",
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x",
                            ]
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ssm-policy-SOPHOS_CNF-ad" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_instance.this will be destroyed
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0f37b9b5182756d01" -> null
      - arn                                  = "arn:aws:ec2:us-west-1:447552758530:instance/i-03a4e07a7fffe273d" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2-instance-profile-SOPHOS_CNF-ad" -> null
      - id                                   = "i-03a4e07a7fffe273d" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "sophos-example-complete18" -> null
      - monitoring                           = true -> null
      - primary_network_interface_id         = "eni-064c7b34fe4c2c906" -> null
      - private_dns                          = "ip-10-0-1-61.us-west-1.compute.internal" -> null
      - private_ip                           = "10.0.1.61" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = false -> null
      - subnet_id                            = "subnet-0df7b78c6184b1c29" -> null
      - tags                                 = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                             = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "06553fd0512ceebd68566f9e5d2b0cac2923b540" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-09e076ed70ef7b370",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvdg" -> null
          - encrypted             = false -> null
          - iops                  = 240 -> null
          - snapshot_id           = "snap-0ac9373189f97066a" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07212f7e3f8f2900c" -> null
          - volume_size           = 80 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - launch_template {
          - id      = "lt-03ddb586d2a556961" -> null
          - name    = "launch-template-SOPHOS_CNF-ad-447552758530" -> null
          - version = "$Latest" -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e536b0cb56b891cf" -> null
          - volume_size           = 16 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-1:447552758530:internet-gateway/igw-00eea38b570eaa98a" -> null
      - id       = "igw-00eea38b570eaa98a" -> null
      - owner_id = "447552758530" -> null
      - tags     = {
          - "Name"          = "igw-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all = {
          - "Name"          = "igw-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id   = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_lambda_function.this will be destroyed
  - resource "aws_lambda_function" "this" {
      - architectures                  = [] -> null
      - arn                            = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-ad" -> null
      - filename                       = "../../initial_config.zip" -> null
      - function_name                  = "XG-Initial-Config-SOPHOS_CNF-ad" -> null
      - handler                        = "config.main" -> null
      - id                             = "XG-Initial-Config-SOPHOS_CNF-ad" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-ad/invocations" -> null
      - last_modified                  = "2022-10-03T21:49:07.541+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-ad:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-ad:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-ad" -> null
      - runtime                        = "python3.7" -> null
      - source_code_hash               = "lN3NThfvLIWT2ZmvwfzeznxJmua0IJpXJCCdXY9Y9z0=" -> null
      - source_code_size               = 772 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CONSOLE_SECRET_ARN" = "sophos-fw-console-password-SOPHOS_CNF-ad"
              - "DEFAULT_PASSWORD"   = "admin"
              - "DEFAULT_USER"       = "admin"
              - "HOST_IP"            = "10.0.1.61"
              - "REGION_NAME"        = "us-west-1"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-09e076ed70ef7b370",
            ] -> null
          - subnet_ids         = [
              - "subnet-0df7b78c6184b1c29",
            ] -> null
          - vpc_id             = "vpc-0200ad8ff9169a516" -> null
        }
    }

  # module.complete.aws_launch_template.this will be destroyed
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-west-1:447552758530:launch-template/lt-03ddb586d2a556961" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-03ddb586d2a556961" -> null
      - image_id                = "ami-0f37b9b5182756d01" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "sophos-example-complete18" -> null
      - latest_version          = 1 -> null
      - name                    = "launch-template-SOPHOS_CNF-ad-447552758530" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - user_data               = "eyJzc21rU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1zZWN1cmUtc3RvcmFnZS1tYXN0ZXIta2V5LVNPUEhPU19DTkYtYWQtNkxWaFp6IiwiaG9zdG5hbWUiOiJzb3Bob3MteGctdGVycmFmb3JtIiwic2VuZHN0YXRzIjogIm9uIiwicmVnaW9uIjoidXMtd2VzdC0xIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1jb25zb2xlLXBhc3N3b3JkLVNPUEhPU19DTkYtYWQtRUpKWEN5IiwiY29uZmlnU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1iYWNrdXAtY29uZmlndXJhdGlvbi1wYXNzd29yZC1TT1BIT1NfQ05GLWFkLXRKUEo1eCJ9" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 16 -> null
              - volume_type           = "gp2" -> null
            }
        }
      - block_device_mappings {
          - device_name = "/dev/xvdg" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 80 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - iam_instance_profile {
          - name = "ec2-iam-role-SOPHOS_CNF-ad-447552758530" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - network_interfaces {
          - device_index         = 1 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-0632b92421afac6e9" -> null
          - security_groups      = [] -> null
        }
      - network_interfaces {
          - device_index         = 0 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-064c7b34fe4c2c906" -> null
          - security_groups      = [] -> null
        }
    }

  # module.complete.aws_network_interface.private will be destroyed
  - resource "aws_network_interface" "private" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-064c7b34fe4c2c906" -> null
      - description               = "ENI for Private Subnet" -> null
      - id                        = "eni-064c7b34fe4c2c906" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:98:53:4c:97:57" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-1-61.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.1.61" -> null
      - private_ip_list           = [
          - "10.0.1.61",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.61",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-09e076ed70ef7b370",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-0df7b78c6184b1c29" -> null
      - tags                      = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0202d160a0bb78b30" -> null
          - device_index  = 0 -> null
          - instance      = "i-03a4e07a7fffe273d" -> null
        }
    }

  # module.complete.aws_network_interface.public will be destroyed
  - resource "aws_network_interface" "public" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0632b92421afac6e9" -> null
      - description               = "ENI for Public Subnet" -> null
      - id                        = "eni-0632b92421afac6e9" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:1c:de:f5:62:25" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-0-188.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.188" -> null
      - private_ip_list           = [
          - "10.0.0.188",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.0.188",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-035862d72b4502a0c",
          - "sg-07414f5c789daf829",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-01b7f2fd859183ca8" -> null
      - tags                      = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0a1e8a49fd58ab633" -> null
          - device_index  = 1 -> null
          - instance      = "i-03a4e07a7fffe273d" -> null
        }
    }

  # module.complete.aws_route.private will be destroyed
  - resource "aws_route" "private" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0e9b786fa5ab6150b1080289494" -> null
      - instance_id            = "i-03a4e07a7fffe273d" -> null
      - instance_owner_id      = "447552758530" -> null
      - network_interface_id   = "eni-064c7b34fe4c2c906" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0e9b786fa5ab6150b" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-00eea38b570eaa98a" -> null
      - id                     = "r-rtb-0cb46e8b77de1c5691080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0cb46e8b77de1c569" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-0e9b786fa5ab6150b" -> null
      - id               = "rtb-0e9b786fa5ab6150b" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = "i-03a4e07a7fffe273d"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-064c7b34fe4c2c906"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-0cb46e8b77de1c569" -> null
      - id               = "rtb-0cb46e8b77de1c569" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-00eea38b570eaa98a"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_route_table_association.private will be destroyed
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0ebe68af53f551e35" -> null
      - route_table_id = "rtb-0e9b786fa5ab6150b" -> null
      - subnet_id      = "subnet-0df7b78c6184b1c29" -> null
    }

  # module.complete.aws_route_table_association.public will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-05dfd1da27fc6beff" -> null
      - route_table_id = "rtb-0cb46e8b77de1c569" -> null
      - subnet_id      = "subnet-01b7f2fd859183ca8" -> null
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret" "config_backup_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x" -> null
      - name                           = "sophos-fw-backup-configuration-password-SOPHOS_CNF-ad" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.console_password will be destroyed
  - resource "aws_secretsmanager_secret" "console_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy" -> null
      - name                           = "sophos-fw-console-password-SOPHOS_CNF-ad" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret" "secure_storage_master_key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz" -> null
      - name                           = "sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "config_backup_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x|9AC04665-6704-4F8C-91B9-1124DE5F9C2C" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x" -> null
      - secret_string  = (sensitive value)
      - version_id     = "9AC04665-6704-4F8C-91B9-1124DE5F9C2C" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "console_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy|03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy" -> null
      - secret_string  = (sensitive value)
      - version_id     = "03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz|95E6CFB8-BD38-4932-8A1F-95A55F053E1C" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz" -> null
      - secret_string  = (sensitive value)
      - version_id     = "95E6CFB8-BD38-4932-8A1F-95A55F053E1C" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_security_group.lan[0] will be destroyed
  - resource "aws_security_group" "lan" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-09e076ed70ef7b370" -> null
      - description            = "Security Group for private subnet. Allow everything by default" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09e076ed70ef7b370" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Private Subnet" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_security_group.public[0] will be destroyed
  - resource "aws_security_group" "public" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-07414f5c789daf829" -> null
      - description            = "Untrusted network restricted from access port 22 and 4444" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-07414f5c789daf829" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 0 - 21"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 21
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 23 - 4443"
              - from_port        = 23
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 4445 - 65535"
              - from_port        = 4445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Public" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_security_group.trusted[0] will be destroyed
  - resource "aws_security_group" "trusted" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-035862d72b4502a0c" -> null
      - description            = "Enable TCP access from trusted network" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-035862d72b4502a0c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "4.1.23.100/32",
                  - "47.184.79.94/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Trusted Network" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_subnet.private[0] will be destroyed
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-0df7b78c6184b1c29" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0df7b78c6184b1c29" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-SOPHOS_CNF-ad-447552758530"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-SOPHOS_CNF-ad-447552758530"
        } -> null
      - vpc_id                                         = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_subnet.public[0] will be destroyed
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-01b7f2fd859183ca8" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01b7f2fd859183ca8" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"          = "public-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                                       = {
          - "Name"          = "public-SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                                         = "vpc-0200ad8ff9169a516" -> null
    }

  # module.complete.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-west-1:447552758530:vpc/vpc-0200ad8ff9169a516" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-087d82d772015c030" -> null
      - default_route_table_id           = "rtb-0d68f05e8a47a99e2" -> null
      - default_security_group_id        = "sg-05767bb2b54b50cbb" -> null
      - dhcp_options_id                  = "dopt-001808c76c9383c0b" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0200ad8ff9169a516" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-0d68f05e8a47a99e2" -> null
      - owner_id                         = "447552758530" -> null
      - tags                             = {
          - "Name"          = "SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                         = {
          - "Name"          = "SOPHOS_CNF-ad-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "10-03-2022"
          - "managed_by"    = "Terraform"
        } -> null
    }

  # module.complete.random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "SOPHOS_CNF-rQ==" -> null
      - b64_url     = "SOPHOS_CNF-rQ" -> null
      - byte_length = 1 -> null
      - dec         = "SOPHOS_CNF-173" -> null
      - hex         = "SOPHOS_CNF-ad" -> null
      - id          = "rQ" -> null
      - prefix      = "SOPHOS_CNF-" -> null
    }

  # module.key-pair.aws_key_pair.this[0] will be destroyed
  - resource "aws_key_pair" "this" {
      - arn         = "arn:aws:ec2:us-west-1:447552758530:key-pair/sophos-example-complete18" -> null
      - fingerprint = "54:9b:51:d7:b9:5c:8d:d2:8c:db:8a:65:6a:67:1d:4d" -> null
      - id          = "sophos-example-complete18" -> null
      - key_name    = "sophos-example-complete18" -> null
      - key_pair_id = "key-0bdfe008f33029b19" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDnYjITrvcyOfroDhNJRc76YLdipiZWfNs45D24l39wedIfFbaxdlJg0AQAqQIByKsGO/b805546AtOEhqF2XEHPzWh2FLqz0/VbYNmzFqNUtCSCVv6gl6BDu+Oh+bx3EKFDIbt/LrEQGIK5xPPrqmMVj+igB3VFtybefFQAHIavHcIa/1A6gv+2BQy01R+ft69TmYPBM2g5jPTrp2ND0mzcsJRMxLxySZmsiRlQY3KGh6/UbtRInpOACHXpZl4LnaAKqSpVScX9epVcCwtSB+DT78IvIwK+AujzKWrAzNfnDYU+/rYWDb/I78HO1EqvXvh4guS4XYhnnDRV1QBQqURE2DXQ5JbYQTc70lvp63IAAQtkcwxit4R/fRTXXEopZbE51GaZkEXzDxZqXk+GS8+6nXkRcbqqkklJ07nX90zjQAdDPTSrsYEoXl7aW6lCLPCl3P1vxJxql8cv6Un6Hua+rnMxSSUl8FdR73eg+z8DivGfKbDmVXpor7pLeAgSwRS1ZyDwVu+tvO08gsUrAYWvl0nkFlduIBAvSxGOtTKpbUBs3UNP5xRJfyRmhpb2eZkCmxO8gN8VqkSCZ8yK05aOfVOYzSxUbxY2hQuhVTp7qCB9W8cldcgGjVQdIBDXH9XgSy3KIpLglTYZ9pKsPpw5BiDQUNQVMnROFjeZe3HQQ==" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.key-pair.tls_private_key.this[0] will be destroyed
  - resource "tls_private_key" "this" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "7d72af341a1b4acc57d87690b2deea29db5e70ea" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "76:f9:9a:c6:f6:a0:bd:cf:bc:fe:02:ec:b1:2a:06:ca" -> null
      - public_key_fingerprint_sha256 = "SHA256:7Mjg4bCNGfNyCPEJvHW1NgaPeBLkWkuu+C1J440kHPg" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDnYjITrvcyOfroDhNJRc76YLdipiZWfNs45D24l39wedIfFbaxdlJg0AQAqQIByKsGO/b805546AtOEhqF2XEHPzWh2FLqz0/VbYNmzFqNUtCSCVv6gl6BDu+Oh+bx3EKFDIbt/LrEQGIK5xPPrqmMVj+igB3VFtybefFQAHIavHcIa/1A6gv+2BQy01R+ft69TmYPBM2g5jPTrp2ND0mzcsJRMxLxySZmsiRlQY3KGh6/UbtRInpOACHXpZl4LnaAKqSpVScX9epVcCwtSB+DT78IvIwK+AujzKWrAzNfnDYU+/rYWDb/I78HO1EqvXvh4guS4XYhnnDRV1QBQqURE2DXQ5JbYQTc70lvp63IAAQtkcwxit4R/fRTXXEopZbE51GaZkEXzDxZqXk+GS8+6nXkRcbqqkklJ07nX90zjQAdDPTSrsYEoXl7aW6lCLPCl3P1vxJxql8cv6Un6Hua+rnMxSSUl8FdR73eg+z8DivGfKbDmVXpor7pLeAgSwRS1ZyDwVu+tvO08gsUrAYWvl0nkFlduIBAvSxGOtTKpbUBs3UNP5xRJfyRmhpb2eZkCmxO8gN8VqkSCZ8yK05aOfVOYzSxUbxY2hQuhVTp7qCB9W8cldcgGjVQdIBDXH9XgSy3KIpLglTYZ9pKsPpw5BiDQUNQVMnROFjeZe3HQQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA52IyE673Mjn66A4TSUXO
            +mC3YqYmVnzbOOQ9uJd/cHnSHxW2sXZSYNAEAKkCAcirBjv2/NOeeOgLThIahdlx
            Bz81odhS6s9P1W2DZsxajVLQkglb+oJegQ7vjofm8dxChQyG7fy6xEBiCucTz66p
            jFY/ooAd1Rbcm3nxUAByGrx3CGv9QOoL/tgUMtNUfn7evU5mDwTNoOYz066djQ9J
            s3LCUTMS8ckmZrIkZUGNyhoev1G7USJ6TgAh16WZeC52gCqkqVUnF/XqVXAsLUgf
            g0+/CLyMCvgLo8ylqwMzX5w2FPv62Fg2/yO/BztRKr174eILkuF2IZ5w0VdUAUKl
            ERNg10OSW2EE3O9Jb6etyAAELZHMMYreEf30U11xKKWWxOdRmmZBF8w8Wal5Phkv
            Pup15EXG6qpJJSdO51/dM40AHQz00q7GBKF5e2lupQizwpdz9b8ScapfHL+lJ+h7
            mvq5zMUklJfBXUe93oPs/A4rxnymw5lV6aK+6S3gIEsEUtWcg8FbvrbztPILFKwG
            Fr5dJ5BZXbiAQL0sRjrUyqW1AbN1DT+cUSX8kZoaW9nmZApsTvIDfFapEgmfMitO
            Wjn1TmM0sVG8WNoULoVU6e6ggfVvHJXXIBo1UHSAQ1x/V4EstyiKS4JU2GfaSrD6
            cOQYg0FDUFTJ0ThY3mXtx0ECAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 0 to add, 0 to change, 32 to destroy.

Changes to Outputs:
  - archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7" -> null
  - availability_zone_map = {
      - us-west-1b = "usw1-az3"
      - us-west-1c = "usw1-az1"
    } -> null
  - console_secret_name   = "sophos-fw-console-password-SOPHOS_CNF-ad" -> null
  - private_key           = (sensitive value)
module.complete.aws_route_table_association.private: Destroying... [id=rtbassoc-0ebe68af53f551e35]
module.complete.aws_route.private: Destroying... [id=r-rtb-0e9b786fa5ab6150b1080289494]
module.complete.aws_route_table_association.public: Destroying... [id=rtbassoc-05dfd1da27fc6beff]
module.complete.aws_secretsmanager_secret_version.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy|03C7B2ED-9C82-4A74-9964-F4D45BFB5BD8]
module.complete.aws_route.public: Destroying... [id=r-rtb-0cb46e8b77de1c5691080289494]
module.complete.aws_eip.this[0]: Destroying... [id=eipalloc-01b124790260b961a]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x|9AC04665-6704-4F8C-91B9-1124DE5F9C2C]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz|95E6CFB8-BD38-4932-8A1F-95A55F053E1C]
module.complete.aws_lambda_function.this: Destroying... [id=XG-Initial-Config-SOPHOS_CNF-ad]
module.complete.aws_instance.this: Destroying... [id=i-03a4e07a7fffe273d]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.console_password: Destruction complete after 0s
module.complete.aws_lambda_function.this: Destruction complete after 0s
module.complete.aws_iam_role.lambda_execution_role: Destroying... [id=LambdaExecutionRole-SOPHOS_CNF-ad]
module.complete.aws_route_table_association.public: Destruction complete after 0s
module.complete.aws_route_table_association.private: Destruction complete after 0s
module.complete.aws_route.private: Destruction complete after 0s
module.complete.aws_route_table.private[0]: Destroying... [id=rtb-0e9b786fa5ab6150b]
module.complete.aws_route.public: Destruction complete after 0s
module.complete.aws_internet_gateway.this[0]: Destroying... [id=igw-00eea38b570eaa98a]
module.complete.aws_route_table.public[0]: Destroying... [id=rtb-0cb46e8b77de1c569]
module.complete.aws_route_table.private[0]: Destruction complete after 0s
module.complete.aws_route_table.public[0]: Destruction complete after 0s
module.complete.aws_iam_role.lambda_execution_role: Destruction complete after 1s
module.complete.aws_eip.this[0]: Destruction complete after 2s
module.complete.aws_internet_gateway.this[0]: Destruction complete after 2s
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 1m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 2m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 3m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 4m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 4m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-03a4e07a7fffe273d, 4m20s elapsed]
module.complete.aws_instance.this: Destruction complete after 4m21s
module.complete.aws_iam_instance_profile.this: Destroying... [id=ec2-instance-profile-SOPHOS_CNF-ad]
module.complete.aws_launch_template.this: Destroying... [id=lt-03ddb586d2a556961]
module.complete.aws_launch_template.this: Destruction complete after 0s
module.key-pair.aws_key_pair.this[0]: Destroying... [id=sophos-example-complete18]
module.complete.aws_network_interface.private: Destroying... [id=eni-064c7b34fe4c2c906]
module.complete.aws_network_interface.public: Destroying... [id=eni-0632b92421afac6e9]
module.key-pair.aws_key_pair.this[0]: Destruction complete after 0s
random_id.this: Destroying... [id=GA]
module.key-pair.tls_private_key.this[0]: Destroying... [id=7d72af341a1b4acc57d87690b2deea29db5e70ea]
module.key-pair.tls_private_key.this[0]: Destruction complete after 0s
random_id.this: Destruction complete after 0s
module.complete.aws_iam_instance_profile.this: Destruction complete after 0s
module.complete.aws_iam_role.this: Destroying... [id=ec2-iam-role-SOPHOS_CNF-ad-447552758530]
module.complete.aws_network_interface.private: Destruction complete after 0s
module.complete.aws_subnet.private[0]: Destroying... [id=subnet-0df7b78c6184b1c29]
module.complete.aws_security_group.lan[0]: Destroying... [id=sg-09e076ed70ef7b370]
module.complete.aws_network_interface.public: Destruction complete after 0s
module.complete.aws_subnet.public[0]: Destroying... [id=subnet-01b7f2fd859183ca8]
module.complete.aws_security_group.trusted[0]: Destroying... [id=sg-035862d72b4502a0c]
module.complete.aws_security_group.public[0]: Destroying... [id=sg-07414f5c789daf829]
module.complete.aws_subnet.public[0]: Destruction complete after 1s
module.complete.aws_security_group.public[0]: Destruction complete after 1s
module.complete.aws_subnet.private[0]: Destruction complete after 1s
module.complete.aws_security_group.trusted[0]: Destruction complete after 1s
module.complete.aws_iam_role.this: Destruction complete after 1s
module.complete.aws_secretsmanager_secret.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-ad-EJJXCy]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-ad-6LVhZz]
module.complete.aws_secretsmanager_secret.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-ad-tJPJ5x]
module.complete.aws_secretsmanager_secret.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_security_group.lan[0]: Destruction complete after 1s
module.complete.aws_vpc.this[0]: Destroying... [id=vpc-0200ad8ff9169a516]
module.complete.aws_vpc.this[0]: Destruction complete after 1s
module.complete.random_id.this: Destroying... [id=rQ]
module.complete.random_id.this: Destruction complete after 0s

Destroy complete! Resources: 32 destroyed.

```